#Вводится 2 числа с клавиатуры (от 1 до 20). Так же генерируется 2 числа рандомно.
#Посчитать, сколько раз пара введенных чисел с клавиатуры окажется больше
#рандомной пары. Проверку выполнить 7 раз.
#В случае равенства (количества, когда пара больше и всех остальных случаем)
#вывести случайные числа, полученные в 4 итерации

import random

s = 1
t = 0
v = 0

while s <= 7:
    a = int(input("Введите первое число от 1 до 20: "))
    b = int(input("Введите второе число от 1 до 20: "))
    c = random.randint(0, 20)
    d = random.randint(0, 20)

    print(s, "попытка")
    if a > c and b > d:
        t += 1
        print(s, "раз введенные числа больше случайных")
    else:
        v += 1
        s += 1
    if s == t and s == 4:
        print("Случайные числа :", c, d)